       01 ADDLSG07-IO.                                                  
          03 CHARGE-CODE    PIC   X(04).                                
          03 FILLER         PIC   X(01).                                
          03 SUR-CHARGE-AMT PIC   S9(03)V9(02).                         
