       01 ORDSEG15-IO.                                                  
          05 ORDER-NUM  PIC   X(05).                                    
          05 FILLER     PIC   X(01).                                    
          05 ORDER-QTY  PIC   9(02).                                    
          05 FILLER     PIC   X(01).                                    
          05 ORDER-DATE PIC   X(08).                                    
