       01 PARTSG01-IO.                                                  
          03 PART-NUM     PIC  X(05).                                   
          03 FILLER       PIC  X(01).                                   
          03 PART-NAME    PIC  X(08).                                   
          03 FILLER       PIC  X(01).                                   
          03 PART-ACTIVE  PIC  X(01).                                   
