       01 PRICSG05-IO.                                                  
          03 PRICE-CODE   PIC   X(04).                                  
          03 FILLER       PIC   X(01).                                  
          03 UNIT-PRICE   PIC   S9(03)V9(02).                           
          03 FILLER       PIC   X(01).                                  
          03 DISC-PRICE   PIC   S9(03)V9(02).                           
