       01 STCKSG10-IO.                                                  
          05  LOC-CODE    PIC  X(04).                                   
          05  FILLER      PIC  X(01).                                   
          05  ON-HAND-QTY PIC  9(03).                                   
          05  FILLER      PIC  X(01).                                   
          05  ORD-QTY     PIC  9(03).                                   
